; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v1 ?v13)
             (pred_7 ?v3 ?v12)
             (pred_10 ?v1 ?v12)
             (pred_4 ?v7 ?v1 )
	     (pred_1 ?v1)
             (pred_12 ?v11)
             (pred_3 ?v3)
             (pred_5 ?v12)
             (pred_11 ?v1)
             (pred_9 ?v3)
             (pred_8 ?v1)
             (pred_6 ))



(:action op_3
:parameters (?v10 ?v6 ?v8 ?v5)
:precondition (and (pred_12 ?v10) (pred_12 ?v6) (pred_3 ?v8) (pred_5 ?v5)
          (pred_2 ?v10 ?v6) (pred_7 ?v8 ?v5)
                   (pred_10 ?v6 ?v5) (pred_1 ?v10) 
                   (pred_11 ?v6) (pred_9 ?v8))
:effect (and  (pred_8 ?v6) (not (pred_11 ?v6))))


(:action op_5
:parameters (?v10 ?v4)
:precondition (and (pred_12 ?v10) (pred_12 ?v4)
               (pred_1 ?v10) (pred_2 ?v10 ?v4) (pred_8 ?v4))
:effect (and (pred_1 ?v4) (not (pred_1 ?v10))))

(:action op_2
:parameters (?v10 ?v8)
:precondition (and (pred_12 ?v10) (pred_3 ?v8) 
                  (pred_1 ?v10) (pred_4 ?v8 ?v10) (pred_6 ))
:effect (and (pred_9 ?v8)
   (not (pred_4 ?v8 ?v10)) (not (pred_6 ))))


(:action op_1
:parameters (?v10 ?v9 ?v2)
:precondition (and (pred_12 ?v10) (pred_3 ?v9) (pred_3 ?v2)
                  (pred_1 ?v10) (pred_9 ?v2) (pred_4 ?v9 ?v10))
:effect (and (pred_9 ?v9) (pred_4 ?v2 ?v10)
        (not (pred_9 ?v2)) (not (pred_4 ?v9 ?v10))))

(:action op_4
:parameters (?v10 ?v8)
:precondition (and (pred_12 ?v10) (pred_3 ?v8) 
                  (pred_1 ?v10) (pred_9 ?v8))
:effect (and (pred_6 ) (pred_4 ?v8 ?v10) (not (pred_9 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_27 obj_29 obj_14 obj_02 obj_21 obj_24 obj_30 obj_16 obj_17 obj_05 obj_32 obj_01 obj_03 obj_12 obj_31 obj_06 obj_13 obj_11 obj_08 obj_20 obj_23 obj_15 obj_28 obj_07 obj_25
    obj_04 obj_10 obj_19
    obj_26 obj_18 obj_09 obj_22
    )

    (:init
       (pred_6)

       (pred_12 obj_27)
       (pred_12 obj_29)
       (pred_12 obj_14)
       (pred_12 obj_02)
       (pred_12 obj_21)
       (pred_12 obj_24)
       (pred_12 obj_30)
       (pred_12 obj_16)
       (pred_12 obj_17)
       (pred_12 obj_05)
       (pred_12 obj_32)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_12)
       (pred_12 obj_31)
       (pred_12 obj_06)
       (pred_12 obj_13)
       (pred_12 obj_11)
       (pred_12 obj_08)
       (pred_12 obj_20)
       (pred_12 obj_23)
       (pred_12 obj_15)
       (pred_12 obj_28)
       (pred_12 obj_07)
       (pred_12 obj_25)
       (pred_5 obj_04)
       (pred_5 obj_10)
       (pred_5 obj_19)
       (pred_3 obj_26)
       (pred_3 obj_18)
       (pred_3 obj_09)
       (pred_3 obj_22)

       (pred_2 obj_27 obj_24)
       (pred_2 obj_27 obj_29)
       (pred_2 obj_29 obj_30)
       (pred_2 obj_29 obj_14)
       (pred_2 obj_29 obj_27)
       (pred_2 obj_14 obj_16)
       (pred_2 obj_14 obj_02)
       (pred_2 obj_14 obj_29)
       (pred_2 obj_02 obj_17)
       (pred_2 obj_02 obj_21)
       (pred_2 obj_02 obj_14)
       (pred_2 obj_21 obj_05)
       (pred_2 obj_21 obj_02)
       (pred_2 obj_24 obj_32)
       (pred_2 obj_24 obj_30)
       (pred_2 obj_24 obj_27)
       (pred_2 obj_30 obj_01)
       (pred_2 obj_30 obj_16)
       (pred_2 obj_30 obj_29)
       (pred_2 obj_30 obj_24)
       (pred_2 obj_16 obj_03)
       (pred_2 obj_16 obj_17)
       (pred_2 obj_16 obj_14)
       (pred_2 obj_16 obj_30)
       (pred_2 obj_17 obj_12)
       (pred_2 obj_17 obj_05)
       (pred_2 obj_17 obj_02)
       (pred_2 obj_17 obj_16)
       (pred_2 obj_05 obj_31)
       (pred_2 obj_05 obj_21)
       (pred_2 obj_05 obj_17)
       (pred_2 obj_32 obj_06)
       (pred_2 obj_32 obj_01)
       (pred_2 obj_32 obj_24)
       (pred_2 obj_01 obj_13)
       (pred_2 obj_01 obj_03)
       (pred_2 obj_01 obj_30)
       (pred_2 obj_01 obj_32)
       (pred_2 obj_03 obj_11)
       (pred_2 obj_03 obj_12)
       (pred_2 obj_03 obj_16)
       (pred_2 obj_03 obj_01)
       (pred_2 obj_12 obj_08)
       (pred_2 obj_12 obj_31)
       (pred_2 obj_12 obj_17)
       (pred_2 obj_12 obj_03)
       (pred_2 obj_31 obj_20)
       (pred_2 obj_31 obj_05)
       (pred_2 obj_31 obj_12)
       (pred_2 obj_06 obj_23)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_06 obj_32)
       (pred_2 obj_13 obj_15)
       (pred_2 obj_13 obj_11)
       (pred_2 obj_13 obj_01)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_11 obj_28)
       (pred_2 obj_11 obj_08)
       (pred_2 obj_11 obj_03)
       (pred_2 obj_11 obj_13)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_08 obj_20)
       (pred_2 obj_08 obj_12)
       (pred_2 obj_08 obj_11)
       (pred_2 obj_20 obj_25)
       (pred_2 obj_20 obj_31)
       (pred_2 obj_20 obj_08)
       (pred_2 obj_23 obj_15)
       (pred_2 obj_23 obj_06)
       (pred_2 obj_15 obj_28)
       (pred_2 obj_15 obj_13)
       (pred_2 obj_15 obj_23)
       (pred_2 obj_28 obj_07)
       (pred_2 obj_28 obj_11)
       (pred_2 obj_28 obj_15)
       (pred_2 obj_07 obj_25)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_28)
       (pred_2 obj_25 obj_20)
       (pred_2 obj_25 obj_07)
       (pred_11 obj_28)
       (pred_11 obj_23)
       (pred_11 obj_15)
       (pred_11 obj_29)
       (pred_10  obj_28 obj_04)
       (pred_10  obj_23 obj_10)
       (pred_10  obj_15 obj_19)
       (pred_10  obj_29 obj_19)
       (pred_8 obj_27)
       (pred_8 obj_14)
       (pred_8 obj_02)
       (pred_8 obj_21)
       (pred_8 obj_24)
       (pred_8 obj_30)
       (pred_8 obj_16)
       (pred_8 obj_17)
       (pred_8 obj_05)
       (pred_8 obj_32)
       (pred_8 obj_01)
       (pred_8 obj_03)
       (pred_8 obj_12)
       (pred_8 obj_31)
       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_8 obj_11)
       (pred_8 obj_08)
       (pred_8 obj_20)
       (pred_8 obj_07)
       (pred_8 obj_25)

       (pred_7  obj_26 obj_04)
       (pred_7  obj_18 obj_10)
       (pred_7  obj_09 obj_19)
       (pred_7  obj_22 obj_19)
       (pred_4 obj_26 obj_03)
       (pred_4 obj_18 obj_30)
       (pred_4 obj_09 obj_12)
       (pred_4 obj_22 obj_14)
       (pred_1 obj_20)
    )

    (:goal (and
       (pred_4 obj_09 obj_31)
       (pred_4 obj_22 obj_08)
    ))
(:constraints
  (always (not (pred_1 obj_17)))
)
)

; plan
1. (op_5 obj_20 obj_08)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_08)
   goals met: 0 of 2
2. (op_5 obj_08 obj_12)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_12)
   goals met: 0 of 2
3. (op_5 obj_12 obj_03)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_03)
   goals met: 0 of 2
4. (op_5 obj_03 obj_16)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_16)
   goals met: 0 of 2
5. (op_5 obj_16 obj_14)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_14)
   goals met: 0 of 2
6. (op_2 obj_14 obj_22)
   deleted: (pred_4 obj_22 obj_14) (pred_6)
   added: (pred_9 obj_22)
   goals met: 0 of 2
7. (op_5 obj_14 obj_02)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_02)
   goals met: 0 of 2
8. (op_5 obj_02 obj_21)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_21)
   goals met: 0 of 2
9. (op_5 obj_21 obj_05)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_05)
   goals met: 0 of 2
10. (op_5 obj_05 obj_31)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_31)
   goals met: 0 of 2
11. (op_5 obj_31 obj_12)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_12)
   goals met: 0 of 2
12. (op_5 obj_12 obj_08)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_08)
   goals met: 0 of 2
13. (op_4 obj_08 obj_22)
   deleted: (pred_9 obj_22)
   added: (pred_6) (pred_4 obj_22 obj_08)
   goals met: 1 of 2
14. (op_5 obj_08 obj_12)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_12)
   goals met: 1 of 2
15. (op_2 obj_12 obj_09)
   deleted: (pred_4 obj_09 obj_12) (pred_6)
   added: (pred_9 obj_09)
   goals met: 1 of 2
16. (op_5 obj_12 obj_31)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_31)
   goals met: 1 of 2
17. (op_4 obj_31 obj_09)
   deleted: (pred_9 obj_09)
   added: (pred_6) (pred_4 obj_09 obj_31)
   goals met: 2 of 2
